{
"APP_NAME": "Task-Manager",
"HOME": "Startseite",
"MY_PROFILE": "Profil",
"MY_TASKS": "Aufgaben",
"ABOUT": "Über",
"LOGIN": "Anmelden",
"REGISTER": "Registrieren",
"LOGOUT": "Abmelden",

"HOME_PAGE_TITLE": "Vereinfachte Lösung zur effizienten Organisation Ihrer Aufgaben mit intuitiven Funktionen",

"ABOUT_TITLE": "Über Task-Manager",
  "ABOUT_DESCRIPTION": "Willkommen bei Task-Manager, Ihre Lösung für effizientes Aufgabenmanagement! Task-Manager ist eine robuste Webanwendung, die entwickelt wurde, um Ihre täglichen Aufgaben zu optimieren, damit Sie organisiert bleiben und sich auf das Wesentliche konzentrieren können. Mit intuitiven Funktionen und einer benutzerfreundlichen Oberfläche ermöglicht Task-Manager den Benutzern, Aufgaben mühelos zu erstellen und zu verwalten.",
  "KEY_FEATURES_TITLE": "Hauptmerkmale",
  "USER_AUTHENTICATION_TITLE": "Benutzerauthentifizierung",
  "USER_AUTHENTICATION_DESCRIPTION": "Task-Manager bietet sichere Benutzerauthentifizierungsfunktionen, die es den Benutzern ermöglichen, ein Konto zu registrieren und sich sicher anzumelden. Mit Passwort-Hashing und Verschlüsselung bleibt Ihre persönlichen Informationen jederzeit geschützt.",
  "PROFILE_MANAGEMENT_TITLE": "Profilverwaltung",
  "PROFILE_MANAGEMENT_DESCRIPTION": "Benutzer haben die Flexibilität, ihre Profile zu aktualisieren, sodass sie ihre Informationen und Präferenzen nach ihren Bedürfnissen anpassen können.",
  "TASK_MANAGEMENT_TITLE": "Aufgabenverwaltung",
  "TASK_MANAGEMENT_DESCRIPTION": "Task-Manager vereinfacht das Aufgabenmanagement, indem es eine umfassende Suite von Tools zum Erstellen, Aktualisieren und Löschen von Aufgaben bietet. Ob es darum geht, tägliche Aufgaben zu organisieren oder Projektmeilensteine zu verfolgen, Task-Manager hat alles im Griff.",
  "LANGUAGE_SWITCH_TITLE": "Sprachumschaltung",
  "LANGUAGE_SWITCH_DESCRIPTION": "Task-Manager unterstützt mehrere Sprachen und ermöglicht es den Nutzern, nahtlos zwischen Englisch und Deutsch zu wechseln. Diese Funktion verbessert die Barrierefreiheit und stellt sicher, dass die Nutzer mit der App in ihrer bevorzugten Sprache interagieren können, was das Benutzererlebnis insgesamt verbessert.",
  "TECHNOLOGIES_USED_TITLE": "Verwendete Technologien",
  "NODE_EXPRESS_TITLE": "Node.js/Express",
  "NODE_EXPRESS_DESCRIPTION": "Das Backend von Task-Manager wird von Node.js betrieben, einer vielseitigen JavaScript-Laufzeitumgebung, und Express, einem minimalistischen Web-Framework für Node.js. Diese leistungsstarke Kombination bietet eine robuste Grundlage für den Aufbau skalierbarer und effizienter serverseitiger Anwendungen.",
  "POSTGRESQL_TITLE": "PostgreSQL",
  "POSTGRESQL_DESCRIPTION": "Task-Manager nutzt PostgreSQL, ein leistungsstarkes Open-Source-Relationales-Datenbankmanagementsystem, um Benutzerdaten sicher zu speichern und zu verwalten.",
  "ANGULAR_TITLE": "Angular",
  "ANGULAR_DESCRIPTION": "Das Frontend von Task-Manager wurde mit Angular entwickelt, einem beliebten, auf TypeScript basierenden Webanwendungs-Framework, das von Google gewartet wird. Die modulare Architektur und das umfangreiche Tooling von Angular ermöglichen eine schnelle Entwicklung dynamischer und reaktionsschneller Benutzeroberflächen.",
  "DOCKER_TITLE": "Docker",
  "DOCKER_DESCRIPTION": "Task-Manager wird mit Docker containerisiert, um eine einfache Bereitstellung und Skalierbarkeit zu ermöglichen.",
  "AWS_TITLE": "Amazon Web Services (AWS)",
  "AMAZON_RDS_TITLE": "Amazon RDS",
  "AMAZON_RDS_DESCRIPTION": "Task-Manager nutzt Amazon RDS (Relational Database Service) für PostgreSQL, um seine Datenbank sicher in der Cloud zu hosten. Mit Funktionen wie automatisierten Backups und Skalierbarkeit vereinfacht Amazon RDS das Datenbankmanagement und erhöht die Zuverlässigkeit der Anwendung.",
  "AMAZON_EC2_TITLE": "Amazon EC2",
  "AMAZON_EC2_DESCRIPTION": "Task-Manager nutzt Amazon EC2 (Elastic Compute Cloud) Instanzen, um seinen Backend-Server zu hosten und so eine hohe Verfügbarkeit und Skalierbarkeit für die effiziente Bearbeitung von Benutzeranfragen zu gewährleisten.",
  "AMAZON_S3_TITLE": "Amazon S3",
  "AMAZON_S3_DESCRIPTION": "Task-Manager speichert seine Frontend-Ressourcen, wie HTML-, CSS- und JavaScript-Dateien, auf Amazon S3 (Simple Storage Service), einem hochskalierbaren Objektspeicherdienst. Amazon S3 bietet dauerhafte und kostengünstige Speicherung für statische Webinhalte, wodurch eine schnelle und zuverlässige Bereitstellung für Benutzer weltweit ermöglicht wird.",
  "FOOTER_TEXT": "Task-Manager ist bestrebt, eine nahtlose Aufgabenmanagement-Erfahrung zu bieten, die Spitzentechnologien mit intuitivem Design kombiniert, um Benutzer zu befähigen und die Produktivität zu steigern. Treten Sie Task-Manager heute bei und übernehmen Sie die Kontrolle über Ihre Aufgaben wie nie zuvor!",

  "PASSWORD": "Kennenwort",
  "NO_ACCOUNT": "Noch kein Konto? ",

  "USERNAME": "Benutzername",
  "FIRST_NAME": "Vorname",
  "LAST_NAME": "Nachname",
  "CONFIRM_PASSWORD": "Kennenwort bestätigen",
  "PROFILE_PICTURE": "Profilbild",
  "HAVE_ACCOUNT": "Schon ein Konto?",

  "TASKS_TITLE": "Meine Aufgaben",
  "NEW_TASK": "Neue Aufgabe",
  "TITLE": "Aufgabentitel",
  "DESCRIPTION": "Beschreibung",
  "DUE_DATE": "Fälligkeitsdatum",
  "CREATED_AT": "Erstellt am",
  "UPDATED_AT": "Aktualisiert am",
  "FILTER_TASKS": "Aufgaben filtern",
  "SEARCH_TASKS": "Aufgaben suchen",
  "STATUS": "Status",
  "ALL": "Alle",
  "COMPLETED": "Abgeschlossen",
  "PENDING": "Ausstehend",
  "IN PROGRESS": "In Bearbeitung",
  "CANCELLED": "Abgebrochen",
  "PRIORITY": "Priorität",
  "LOW": "Niedrig",
  "MEDIUM": "Mittel",
  "HIGH": "Hoch",
  "URGENT": "Dringend",
  "ADD_NEW_TASK": "Neue Aufgabe",
  "DELETE_TASK": "Aufgabe löschen",
  "EDIT_TASK": "Aufgabe aktualisieren",
  "DELETE": "Löschen",
  "UPDATE": "Aktualisieren",

  "ADD_TASK": "Aufgabe hinzufügen",
  "SELECT_STATUS": "Status auswählen",
  "SELECT_PRIORITY": "Priorität auswählen",
  "CANCEL": "Abbrechen",
  "CREATE": "Erstellen",
  "CONFIRM": "Bestätigen",

  "DELETE_CONFIRMATION_PART1": "Sind Sie sicher, dass Sie",
  "DELETE_CONFIRMATION_PART2": "löschen möchten?",
  "DELETE_WARNING": "Diese Aktion kann nicht rückgängig gemacht werden.",

  "EDIT_PROFILE": "Aktualisieren",
  "CHANGE_PASSWORD": "Kennenwort ändern",
  "NEW_PASSWORD": "Neu Kennenwort",
  "CONFIRM_NEW_PASSWORD": "Neu Kennenwort bestätigen",

  "NEW_USERNAME": "Neuer Benutzername",
  "NEW_FIRST_NAME": "Neuer Vorname",
  "NEW_LAST_NAME": "Neuer Nachname",
  "EDIT_PROFILE_PICTURE": "Profilbild Aktualisieren",
  "UPLOAD": "Hochladen",

  "EMAIL_OR_PASSWORD_ERROR": "Ungültige E-Mail oder Passwort",
  "EMAIL_VALID_ERROR": "Ungültiges E-Mail-Format",
  "SEARCH_TASK_ERROR": "Keine Aufgaben gefunden",
  "USERNAME_EXISTS": "Benutzername existiert bereits",
  "EMAIL_EXISTS": "E-Mail existiert bereits",
  "REQUIRED_FIELDS": "Bitte füllen Sie alle erforderlichen Felder mit * aus!",
  "PASSWORDS_DO_NOT_MATCH": "Passwort und Bestätigungspasswort stimmen nicht überein."
  }